[
  {
    "id": "0",
    "name": "Apple___alternaria_leaf_spot",
    "description": "Alternaria Thriving Conditions: Alternaria species thrive in various conditions, with a preference for cool and damp environments. Heavy rainfall, especially in spring or fall, can trigger an outbreak. Optimal conditions include humidity around 85% and temperatures of 55-85°F (12-29°C). Regions like the Pacific Northwest, New England, Olde England, Canada, and Northern Europe are particularly susceptible. Alternaria often hides in shady areas like under trees and tall grasses, ideal for its growth.\nControl: Immediately remove infected plant parts and burn them. Treat surrounding plants with fungicides containing potassium bicarbonate, powdered sulfur, Bacillus subtilis, copper hydroxide, or mancozeb. Avoid planting the same type of crops in the affected area for three to five years after the growing season ends. Regular crop rotation and deep tilling can prevent many soil-borne pathogens. Ensure this is done during dry heat waves to avoid spreading fungal spores. Clean up garden debris in spring and autumn, and remove fallen leaves from around plant stems as they grow.\nPrevention: Deep tilling during hot, dry weather can effectively eradicate it. Allow the sun to destroy the spores over a few days. Delay planting seedlings until after the last frost date and ensure the soil is adequately warm. Use drip irrigation at ground level and avoid overhead watering. Trim excessive foliage during humid periods to improve air circulation around leaves.\n"
  },
  {
    "id": "1",
    "name": "Apple___black_rot",
    "description": "Cause: Black rot is a disease of apples that infects fruit, leaves, and bark caused by the fungus Botryosphaeria obtusa.\nTreatment: Treating black rot on apple trees starts with sanitation. Since fungal spores overwinter on fallen leaves, mummified fruits, dead bark, and cankers, it's important to keep all the fallen debris and dead fruit cleaned up and away from the tree. During the winter, check for red cankers and remove them by cutting them out or pruning away the affected limbs at least 6 inches (15 cm.) beyond the wound. Destroy all infected tissue immediately and keep a watchful eye out for new signs of infection. Once black rot disease is under control in your tree and you're again harvesting healthy fruits, make sure to remove any injured or insect-invaded fruits to avoid re-infection.\nPrevention: You can use general-purpose fungicides, like copper-based sprays and lime sulfur, can be used to control black rot, but nothing will improve apple black rot like removing all sources of spores.\n"
  },
  {
    "id": "2",
    "name": "Apple___brown_spot",
    "description": "Cause: Apple scab is affecting the tree, a disease more prevalent in regions with cool, damp spring weather, caused by the fungus Venturia inaequalis.\nManaging and Treating: Dealing with apple scab involves a combination of sanitation, using resistant varieties, and fungicides. Here are steps to manage and treat the disease:\nChoose Resistant Cultivars: Select resistant varieties whenever possible as the primary defense.\nProper Tree Planting: Ensure proper planting in full sun with adequate space between trees for air circulation, reducing moisture on leaves.\nPrune Infected Leaves: Rake under trees, prune, and dispose of infected leaves to minimize fungal spores for the next spring cycle.\nApply Urea: Apply urea after harvest, before fall leaf drop, to accelerate leaf decomposition.\nAdjust Watering Schedule: Water in the evening or early morning to allow leaves to dry, avoiding overhead irrigation to reduce apple scab risk.\nUse Compost Cover: Spread compost under trees to prevent splash dispersal of fungal spores, providing nutrients and containing infection.\nSpray Liquid Copper Soap: Apply liquid copper soap early, two weeks before symptoms or at first appearance, repeating every 7 to 10 days until blossom drop for effective control.\n"
  },
  {
    "id": "3",
    "name": "Apple___gray_spot",
    "description": "Cause: This disease is caused by the fungi Sphaerotheca species or Podosphaera species and is most prevalent during dry, hot periods. The fungus causes gray-white powdery patches on leaves and new shoots. New growth is often stunted, curled and distorted. Fruit may turn russet-colored and develop poorly.\nPrevention & Treatment: Prune out branches or infected twigs early in the season. If disease is severe enough to warrant chemical control, choose one of the following fungicides for use on apple trees and crabapple trees: thiophanate-methyl, myclobutanil, a copper fungicide or sulfur.\n"
  },
  {
    "id": "4",
    "name": "Apple___healthy",
    "description": "Don't worry the plant is healthy.\n"
  },
  {
    "id": "5",
    "name": "Apple___rust",
    "description": "Cause: Apple rust is caused by the fungus Gymnosporangium juniperi-virginianae Schwein, is a common disease that affects species from the rose family, including apple and hawthorns.\nPrevention & Treatment: Plant resistant varieties. If possible, remove Eastern red cedars from the area or prune out galls on nearby cedars. If disease is severe enough to warrant chemical control, select from the chemicals below. For apples select one of the following: mancozeb (do not apply after bloom), myclobutanil or sulfur. The fungicide for use on crabapple trees is mancozeb (do not spray after bloom) or myclobutanil.\n"
  },
  {
    "id": "6",
    "name": "Apple___scab",
    "description": "Causes of Apple Scab: Apple scab is caused by the fungus Venturia inaequalis, which survives winter in diseased leaves on the ground. In spring, the fungus produces spores that spread through wind, rain, or irrigation, infecting new growth on the same or nearby trees. Spores germinate in moist conditions around 70°F, leading to secondary infections every 9 to 17 days during warm, wet weather.\nControl: Prune and dispose of infected leaves, spray trees weekly with neem oil, and remove fallen leaves before May. Choose scab-resistant varieties like William’s Pride, Liberty, or Easy-Gro.\nPrevention: Choose disease-resistant varieties or plant dwarf trees. Practice proper sanitation by removing fallen leaves year-round and avoid composting infected leaves. Pruning helps maintain an open canopy to prevent spore germination. Fungicide spraying is a last resort after consecutive leaf loss.\n"
  },
  {
    "id": "7",
    "name": "Bell_pepper___bacterial_spot",
    "description": "Causes of Bacterial Leaf Spot of Pepper: The bacterium Xanthomonas campestris pv. vesicatoria is responsible for bacterial leaf spot, thriving in hot summers with frequent rainfall. Plant debris in the soil and infected seeds spread the bacterium.\nTreatment and Prevention of Bacterial Leaf Spot: Once symptoms appear, it's too late to save the pepper plants. To prevent future issues, practice crop rotation, avoiding planting peppers or tomatoes in the same location for four or five years. Remove and destroy crop debris, avoiding composting. Till or turn the soil to bury remaining bacteria. Reduce splatter by using a soaker hose and avoiding overhead watering. Stay out of the garden on wet days to prevent disease spread. Purchase certified disease-free seeds and seedlings, avoiding saving seeds if there's a history of bacterial leaf spot on peppers.\n"
  },
  {
    "id": "8",
    "name": "Bell_pepper___healthy",
    "description": "Don't worry the plant is healthy.\n"
  },
  {
    "id": "9",
    "name": "Blueberry___healthy",
    "description": "Don't worry the plant is healthy.\n"
  },
  {
    "id": "10",
    "name": "Cassava___bacterial_blight",
    "description": "Causes and Transmission of CBB: CBB is caused by a bacterium (Xanthomonas campestris pv. manihotis) and spreads when the bacterial organism is transferred from an infected plant to a susceptible one. The bacterium often enters plants through wounds on leaves and stems, and tools like cutlasses can transmit the disease if not cleaned. Infected plant stems are sources of the bacterium, and the disease spreads through cuttings in new farms. Grasshoppers and other insects feeding on cassava can also transmit the disease within a farm or over long distances.\nControl:\nResistant Varieties: In CBB endemic areas, farmers should plant resistant cassava varieties to sustain economic yields.\nRouging of Plants: Regularly inspect and remove plants with CBB symptoms, burning them to prevent disease spread.\nFallow: If outbreaks occur, harvest roots immediately, destroy plant debris through burning or deep plowing, and let the land fallow for at least three years before replanting cassava.\nCrop Rotation: After destroying infected debris, plant cereals, grains, or legumes on the same land, returning to cassava after three seasons.\nQuarantine Measures: Implement localized quarantine measures to prevent the movement of planting materials from CBB outbreak zones to other communities.\nUse of Healthy Planting Material: Harvest stems from disease-free plants and avoid using materials from farms suspected of CBB attack.\nPest Control: Implement environmentally friendly measures to control grasshoppers and other insects that can carry the bacterium, reducing the spread of CBB.\n"
  },
  {
    "id": "11",
    "name": "Cassava___brown_streak_disease",
    "description": "Causes: The cassava brown streak virus (CBSV) is responsible for the symptoms, primarily transmitted by mites, aphids, and the whitefly Bemisia tabaci. However, human transportation of infected cuttings and poor field hygiene are the main contributors to disease spread. Varieties of cassava exhibit varying sensitivity to CBSV, with yield losses ranging from 18-70% depending on infection areas and environmental factors. Quarantine measures are necessary to prevent the movement of infected cuttings to unaffected regions.\nTreatment: Integrated approaches combining preventive measures and biological treatments are preferred, as chemical applications are ineffective against CBSV. Vector control, particularly targeting the whitefly population, is crucial. Efforts focus on developing resistant cassava cultivars and managing root rot caused by CBSV.\nPreventive Measures:\nUse certified virus-free planting material.\nGrow resistant or tolerant cassava varieties.\nMonitor fields regularly and remove diseased plants promptly.\nDestroy removed plants immediately to prevent further spread.\nMaintain weed-free fields to deter insect hosts.\nDisinfect tools between field work sessions.\nAvoid transporting cuttings to new areas.\n"
  },
  {
    "id": "12",
    "name": "Cassava___green_mottle",
    "description": "Cause: Cassava Mosaic Virus (CMV) is the culprit, transmitted by whiteflies and targeting cassava plant leaves. The virus disrupts the plant's growth and yield.\nControl: Cultural control is crucial in minimizing the disease's impact:\nBefore planting:\n• Only use cuttings from symptom-free plants with high root yields.\nDuring growth:\n• Immediately remove symptomatic plants and burn them. Do not wait until harvest, as symptoms may fade, making infected plants harder to identify.\n"
  },
  {
    "id": "13",
    "name": "Cassava___healthy",
    "description": "Don't worry the plant is healthy.\n"
  },
  {
    "id": "14",
    "name": "Cassava___mosaic_disease",
    "description": "Cause: Mosaic viruses are caused by a variety of cassava mosaic geminiviruses (CMGs which are destructive parasites that can affect plants, gardens, and crops at a molecular level. They spread through weeds, infected seeds, plants, or certain insects. Mosaic viruses persist in perennial weeds during winter and are transmitted by insects like aphids, leafhoppers, whiteflies, and cucumber beetles. Aphids, especially, are common carriers, making aphid control crucial for garden health. Infected soil, seeds, containers, and plant divisions can also spread the virus.\nTreatment and Prevention: There's no cure for mosaic virus once a plant is infected, so prevention is key:\nFungicides don't work against viral diseases like mosaic virus.\nUse resistant plant varieties and buy transplants from trusted sources.\nAvoid saving seeds from infected crops.\nEmploy natural pest control methods to reduce disease-carrying insects.\nRemove perennial weeds within 100 yards of your garden.\nClean and disinfect gardening tools regularly to prevent transmission.\nAvoid gardening in wet conditions to prevent virus spread.\nDon't use tobacco near susceptible plants, as tobacco products can spread the virus.\nRemove and destroy infected plants.\n"
  },
  {
    "id": "15",
    "name": "Cherry___healthy",
    "description": "Don't worry the plant is healthy.\n"
  },
  {
    "id": "16",
    "name": "Cherry___powdery_mildew",
    "description": "Causes: Powdery mildew is caused by various closely related fungal species, each with a specific host range. The disease thrives in conditions of low soil moisture and high humidity at the plant surface, typically appearing later in the growing season on outdoor plants.\nTreatment: Effectively treat powdery mildew with various home remedies and fungicides. Milk sprays (40% milk and 60% water) and a solution of baking soda and liquid soap in water are effective. Regular washing of foliage disrupts spore-releasing cycles. Sulfur or copper-based fungicides, potassium bicarbonate, and broad-spectrum bio-fungicides. Indoor growers can use a Sulfur Burner/Vaporizer.\nPrevention:\nPlant resistant cultivars in sunny locations.\nPrune or stake plants for better air circulation, disinfecting tools after each cut.\nRemove diseased foliage and clean fallen debris.\nApply a thick layer of mulch to prevent spore splashing.\nWater in the morning and use drip irrigation to keep foliage dry.\nUse slow-release, organic fertilizer, avoiding excess nitrogen.\n"
  },
  {
    "id": "17",
    "name": "Corn___common_rust",
    "description": "Causes: Common rust is caused by the fungus Puccinia sorghi. Late infections have minimal impact on yield. The fungus overwinters in southern states and its spores are carried by wind to northern states during the growing season. Disease development is favored by cool, moist weather (60 – 70◦ F).\nTreatment: At the first sign of infection, promptly apply fungicide to the corn. Two applications may be needed for effective control.\nPrevention:\nPlant corn early in the growing season to reduce disease risk.\nUse disease-resistant cultivars like ‘Xtra Tender 277’, ‘Snowmass’, and others.\nMonitor for pustules from the whorl stage onwards and spray when 80% of leaves have them. Avoid planting near fields with different corn maturities and those with poor air circulation.\n"
  },
  {
    "id": "18",
    "name": "Corn___gray_leaf_spot",
    "description": "Causes: Gray leaf spot (GLS) is caused by the fungus Cercospora zeae-maydis. GLS can occur almost every growing season in corn, particularly in the North Central and Southeast regions. It is one of the most common and aggressive diseases affecting corn.\nManagement: • To mitigate GLS, preventive measures such as using less susceptible corn varieties, practicing crop rotation, removing crop residue, or employing tillage to speed up residue decomposition can be effective. GLS fungi survive in corn residue and can accumulate in continuous corn or reduced tillage systems. A rotation of at least two years is advised for fields with conservation tillage to reduce inoculum levels. Seek advice from your seed supplier regarding resistant corn products and other agronomic benefits.\n• Regular scouting for GLS should begin around the V-10 to V-14 stages to assess the severity of the infection. If GLS is detected and weather conditions favor disease progression, applying fungicides during the tasseling to early silk growth stages (VT to R1) can protect against yield loss. Fungicides containing strobilurin and strobilurin/triazole combinations are most effective in preventing yield loss due to GLS.\n"
  },
  {
    "id": "19",
    "name": "Corn___healthy",
    "description": "Don't worry the plant is healthy.\n"
  },
  {
    "id": "20",
    "name": "Corn___northern_leaf_blight",
    "description": "Causes: Northern corn leaf blight (NCLB), caused by the fungus Exserohilum turcicum, is becoming a more significant issue in the U.S. Corn Belt. The disease has been consistently present in Indiana and its prevalence has increased since the mid- to late 2000s.\nTreatment: Managing northern corn leaf blight typically involves the use of fungicides. While most home gardeners may not need this step, it can be considered for severe infections. The application of fungicides is usually recommended around the time of silking when the infection tends to start.\nManagement and Prevention:\nChoose corn varieties or hybrids that are resistant or moderately resistant to northern corn leaf blight.\nEnsure proper drainage for your corn crop to avoid prolonged leaf wetness, as the fungus requires 6 to 18 hours of wetness to develop.\nProvide adequate spacing between corn plants to facilitate airflow, and water in the morning to allow leaves to dry during the day.\nSince the fungus overwinters in plant material, it's crucial to manage infected plants. Tilling them into the soil is one approach, but in small gardens, removing and destroying affected plants may be more practical.\n"
  },
  {
    "id": "21",
    "name": "Grape___black_measles",
    "description": "Causes: Measles and grapevine decline are caused by two genera of fungi: Phaeomoniella chlamydospora and Phaeoacremonium spp. These fungi affect young vineyards.\nTreatment: There isn’t a specific treatment. Wine grape growers with small vineyards often remove infected fruit before harvest. Raisins affected by measles are discarded during harvest or at the packing house. Table grape growers may leave affected fruit on the vine.\nManagement: Currently, there are no effective management strategies for measles. Ongoing research focuses on protecting pruning wounds from fungal infections to minimize colonization by suspect fungi.\n"
  },
  {
    "id": "22",
    "name": "Grape___black_rot",
    "description": "Causes: Black rot is caused by the fungus Guignardia bidwellii and thrives in warm, humid climates.\nTreating Black Rot: Treating grapevines affected by black rot involves different approaches depending on the severity: Cultural Control Measures:\nSanitation: Remove debris and infected parts to prevent reinfection.\nFungicide Sprays: Apply fungicides regularly to protect vines. Biological Control: Introduce non-pathogenic microorganisms to the vineyard ecosystem to protect against harmful organisms. Chemical Control Measures: Use fungicides or bactericides to control black rot, but be cautious of drawbacks like chemical resistance. Natural Remedies:\nBaking Soda Solution: Apply weekly until symptoms vanish.\nNeem Oil: Acts as a natural repellent against pests like snails. Preventing Black Rot: Prevention is key:\nRegular Pruning: Remove infected parts promptly.\nMaintain Cleanliness: Remove weeds that may harbor pests.\nUse Resistant Varieties: Choose grape varieties bred for disease resistance.\n"
  },
  {
    "id": "23",
    "name": "Grape___healthy",
    "description": "Don't worry the plant is healthy.\n"
  },
  {
    "id": "24",
    "name": "Grape___isariopsis_leaf_spot",
    "description": "Cause: It is caused by the Pseudocercospora vitis fungus. Special fungicides are used as a remedy to limit the spread of the disease\nManagement:\nPromote plant vigor.\nIncrease air circulation to encourage drying of plant tissues (pruning, thinning, spacing, and managing weeds).\nApply fungicides (especially early season fungicides used to control primary diseases)\nUse the essential oil of lemon grass\n"
  },
  {
    "id": "25",
    "name": "Grape_leaf_blight",
    "description": "Cause: leaf blight or Early blight, caused by the fungus Alternaria solani, is widespread in the United States. Symptoms initially manifest on lower, older leaves as small brown spots with concentric rings resembling a \"bull’s eye\" pattern. As the disease progresses, it spreads outward on the leaf surface, leading to yellowing, withering, and eventual death. Eventually, the stem, fruit, and upper parts of the plant become infected, potentially resulting in severe crop damage.\nEarly blight overwinters on infected plant tissue and spreads through splashing rain, irrigation, insects, and garden tools. Despite its name, early blight can occur at any point during the growing season, especially under high temperatures (80-85˚F) and humid conditions. Plants that are poorly nourished or stressed are particularly vulnerable.\nTreatment:\nPrune or stake plants to enhance air circulation and minimize fungal issues.\nDisinfect pruning shears (one part bleach to four parts water) after each use.\nMaintain clean soil under plants, free of garden debris, and apply organic compost to prevent spore splashing.\nUtilize drip irrigation or soaker hoses to keep foliage dry.\nApply copper-based fungicides proactively, either two weeks before expected disease onset or when prolonged wet weather is forecasted. Alternatively, begin treatment at the first signs of disease and repeat every 7-10 days as necessary.\nRemove and dispose of all garden debris after harvest and practice crop rotation the following year.\nBurn or bag infected plant parts; do not compost.\n"
  },
  {
    "id": "26",
    "name": "Orange___citrus_greening",
    "description": "Cause: Citrus greening is caused by the Asian citrus psyllid (ACP), a small sap-sucking insect that carries Candidatus liberibacter asiaticus (CLas), the bacterium responsible for HLB. Psyllids transmit the disease while feeding, and once the disease takes hold, there is no cure for the affected tree.\nPrevention: There is no cure for citrus greening, underscoring the importance of early detection to swiftly remove infected trees and halt the bacteria's spread. Infected trees become unproductive and act as a reservoir for this economically harmful disease. Common citrus fruit trees, including oranges, limes, and lemons, as well as ornamentals like orange jasmine, jackfruit, and limeberry, can be affected. Erecting a tightly woven screen house around disease-free citrus trees may help prevent citrus greening, considering psyllids are small. Insecticides, although potentially harmful to pollinating bees, could be useful in citrus greening quarantine zones, with options like chlorantraniliprole, spinetoram, dimethoate, or formetanate for treating citrus tree leaves.\n"
  },
  {
    "id": "27",
    "name": "Peach___bacterial_spot",
    "description": "Cause: Bacterial spot is caused by the Xanthomonas campestris bacterium, a pathogen that is widespread globally. The bacterium infects peach trees through wounds or natural openings in the leaves and fruit, thriving in warm, humid conditions and causing significant damage to the plant.\nTreatment: While there's no cure for bacterial spot, several measures can reduce its severity and prevent its spread.\nRemove affected fruit with a sharp knife, sealing them in bags away from the garden to prevent spreading.\nPrune infected branches with sterilized shears, disposing of them in sealed bags to prevent further contamination.\nMaintain a clean area around the peach tree by removing weeds and debris, as they can foster disease spread. Water the tree at the base to keep foliage dry and discourage bacterial spot.\nApply copper-based fungicide every 7-10 days as directed on the label to reduce bacterial spot severity.\nPrevention: First, select resistant peach varieties suitable for your climate. Second, maintain good sanitation by keeping the area around peach trees clean from debris and fallen fruit, and promptly removing dead or diseased branches. Third, ensure optimal soil pH between 6.0 and 6.5, testing soil as needed. Fourth, water trees deeply and infrequently to keep soil evenly moist. Fifth, use balanced fertilizers low in nitrogen, following package instructions. Finally, employ pesticides like copper-based fungicides, following label instructions precisely. By following these practices, you can effectively prevent bacterial spot on your peach trees and ensure a healthy harvest.\nTop of Form\n"
  },
  {
    "id": "28",
    "name": "Peach___healthy",
    "description": "Don't worry the plant is healthy.\n"
  },
  {
    "id": "29",
    "name": "Potato___bacterial_wilt",
    "description": "Cause: Bacterial wilt is caused by a soil-borne bacterium called Ralstonia solanacearum (formerly known as Pseudomonas solanacearum). It primarily affects the roots of potatoes, entering through points of injury caused by farming tools, equipment, or soil pests.\nTreatment: Bacterial wilt is challenging to control and eliminate due to the bacteria's soil-borne nature. The following measures can help minimize its spread:\nMachinery, Bags, and Equipment: • Keep machinery within diseased areas during operations. • Disinfect machinery in dedicated wash-down areas after use in affected areas. • Use high-pressure washing to clean machinery, sheds, and equipment, removing soil. • Thoroughly clean and disinfect second-hand bags or bins before reuse, and discard if necessary.\nVehicles: • Load and unload vehicles only in designated areas away from potato fields. • Choose transport routes that minimize travel through potato paddocks.\nClothing and Boots: • Ensure personnel change into clean clothing and boots upon leaving affected areas, or disinfect boots. • Require visitors, contractors, and workers to wear protective clothing and footwear on the property.\nDiseased Produce: • After harvest, bury all diseased and discarded tubers at least 1 meter underground. • Avoid using produce from diseased crops as seed.\nPreventing bacterial wilt: Implement the following measures to prevent bacterial wilt: • Rotate crops with pastures, cereals, and non-solanaceous crops for periods exceeding 5 years. • Use certified seed from trusted sources. • Plant in areas where bacterial wilt hasn't been previously observed. • Control self-sown potatoes. • Manage weed hosts (such as nightshade and thorn apple) in channels and paddocks after potato cropping. • Avoid deep ploughing, as the bacteria can survive in deep, cool soil layers. • Manage irrigation water to prevent contamination of soil or water sources. • Regularly inspect crops for disease symptoms and remove and destroy affected plants and tubers. • Use livestock to clean up chats, discarded tubers, and crop debris, but prevent their return to clean paddocks. • Do not return potato waste, such as oversized, misshapen, or diseased tubers, to paddocks.\n"
  },
  {
    "id": "30",
    "name": "Potato___early_blight",
    "description": "Cause: Early blight in potato plants is caused by the fungus Alternaria solani and is prevalent throughout the United States. It persists on infected plant tissue during winter and spreads through splashing rain, irrigation, insects, and garden tools. The disease can also be transmitted through potato tubers. Despite its name, early blight can occur at any time during the growing season. High temperatures (80-85˚F) and humid conditions promote its rapid spread, particularly affecting poorly nourished or stressed plants.\nTreatment:\nImprove air circulation by pruning or staking plants to reduce fungal issues.\nDisinfect pruning shears (one part bleach to four parts water) after each use.\nKeep soil under plants clean and free of debris, adding organic compost to prevent spore splashing.\nUtilize drip irrigation or soaker hoses to keep foliage dry.\nApply copper-based fungicides preemptively, two weeks before disease onset or during extended wet periods. Alternatively, begin treatment upon first disease signs and repeat every 7-10 days as needed.\nDispose of garden debris post-harvest and rotate crops the next year.\nBurn or bag infected plant parts; do not compost.\nPrevention: Preventing potato blight involves maintaining crop health, selecting blight-resistant potato varieties, and practicing good sanitation, including cleaning garden tools to prevent bacterial spread. Regularly inspect crops, especially after wet weather or high humidity, to detect early signs of infection.\n"
  },
  {
    "id": "31",
    "name": "Potato ___healthy",
    "description": "Don’t worry the plant is healthy\n"
  },
  {
    "id": "32",
    "name": "Potato___late_blight",
    "description": "Late blight of potato is a serious disease caused by Phytophthora infestans.\nTreatment:\nThe treatment of late blight in potatoes involves spraying the crop with foliar fungicides.\nApply scheduled sprays, in order to avoid the disease from developing.\nBoth protectant and systemic fungicides are available. Protectant fungicides create a protective coat on the stems and leaves to prevent infection, while systemic fungicides protect other plant parts from being infected.\nCrop must be sprayed before the infection occurs, because it is difficult to stop the spread of an existing disease.\nFungicides that are used against phytophthora infestans in potato include Ametoctradin, Benalaxyl, Benthiavalicarb- Isopropyl, Chlorothalonil, Copper hydroxide (for organic potato production), Dimethomorph, Mancozeb, Metalaxyl and some others.\nPrevention:\n1.Use disease-free seed potatoes\n2.Plant resistant cultivars when available.\n3.Remove volunteers from the garden prior to planting and space plants far enough apart to allow for plenty of air circulation.\n4.Water in the early morning hours, or use soaker hoses, to give plants time to dry out during the day -avoid overhead irrigation.\n5.Kill vines completely before harvest to avoid inoculation of the tubers during harvest\n6.Destroy all tomato and potato debris after harvest .\n"
  },
  {
    "id": "33",
    "name": "Potato___nematode",
    "description": "Nematodes are multicellular, unsegmented, worm-like animals. Potato cyst nematodes feed on the roots of potatoes and other solanaceous plants.\nCauses of Potato Cyst Nematode (PCN):\nNematode Species: Potato Cyst Nematodes, including Globodera rostochiensis (golden nematode) and Globodera pallida (pale cyst nematode), are major pests of potatoes.\nLife Cycle: PCNs have a complex life cycle involving cysts that contain eggs. These cysts can survive in the soil for several years.\nInfestation: Nematode cysts infect potato roots, causing damage and affecting nutrient uptake.\nSymptoms: Infected plants may show symptoms like stunted growth, yellowing, and reduced yield.\nSpread: Nematodes can spread through infected seed potatoes, contaminated soil, machinery, and water.\nFavorable Conditions: PCNs thrive in cool and moist soil conditions.\nTreatment & prevention for Potato Nematodes:\nCrop Rotation: Rotate crops to disrupt the nematode life cycle.\nResistant Varieties: Plant nematode-resistant potato varieties.\nSoil Solarization: Use transparent plastic to solarize the soil and reduce nematode populations.\nNematicides: Consider chemical control cautiously, considering environmental impact.\nOrganic Amendments: Add compost or well-rotted manure to improve soil health.\nBiocontrol Agents: Explore beneficial organisms like nematode-trapping fungi.\nMonitoring: Regularly check for symptoms and consult local experts for precise recommendations.\n"
  },
  {
    "id": "34",
    "name": "Potato___pests",
    "description": "DISEASES:\nViruses are disseminated in tubers and can cut yields by 50 percent.\n-Late blight, the most serious potato disease worldwide, is caused by a water mould, Phytophthora infestans, that destroys leaves, stems, and tubers.\n-Bacterial wilt, caused by the bacterial pathogen, leads to severe losses in tropical, subtropical, and temperate regions.\n-Potato blackleg, a bacterial infection, causes tubers to rot in the ground and in storage.\ntreatment of late blight:\n1.Plant resistant cultivars when available.\n2.Remove volunteers from the garden prior to planting and space plants far enough apart to allow for plenty of air circulation.\n3.Water in the early morning hours, or use soaker hoses, to give plants time to dry out during the day — avoid overhead irrigation.\n4.Destroy all tomato and potato debris after harvest (see Fall Garden Cleanup).\ntreatment of bacterial wilt:\nBacterial wilt can be controlled by exposing the seed tubers to hot air (112 ºF) with 75% relative humidity for 30 min.\ntreatment of potato blackleg:\nPlanting:\n-Remove volunteer potatoes and weeds.\n-Use certified seed potatoes; avoid cutting if possible.\n-Sanitize machinery used for cutting.\n-Plant well-suberized seed pieces in well-drained soil at ≥10°C.\n-Avoid irrigation before plant emergence; reduce canopy density.\nIrrigation:\n-Plant in well-drained soil; avoid surface water for irrigation.\nCrop Rotation:\n-Rotate away from potatoes for at least one season.\n-Consider other crops like carrots, parsnips, broccoli for rotation.\nHarvest and Storage:\n-Harvest when vines are dead; minimize tuber bruising.\n-Avoid rough handling at harvest; harvest during dry weather.\n-Remove soil, store tubers at 10,13°C, 95% humidity for up to two weeks.\n-Decrease temperature to <10°C; ensure good ventilation; regulate humidity to prevent condensation without tuber dehydration.\n"
  },
  {
    "id": "35",
    "name": "Potato___phytophthora",
    "description": "Preventing/Minimizing Late Blight Infection:\nEarthing Up: Heap soil around crops to shield tubers from falling spores.\nCrop Rotation: Rotate potatoes with crops from different families to disrupt pathogen reservoirs.\nField Clean-Up: Thoroughly clean fields to eliminate infectious oospores.\nBury or transport infected tubers for proper disposal.\nDrainage and Air Movement: Ensure proper field drainage and promote air movement to regulate air moisture.\nUse Certified and Resistant Tubers: Plant certified and late blight-resistant tubers to reduce susceptibility.\nIrrigation Intervals: Maintain intervals between irrigations to minimize leaf wetness duration.\nRegulate Nitrogen Fertilizers: Control nitrogen fertilizer use to prevent excessive foliage and reduce pathogen exposure.\nTreatment:\nThe treatment of late blight in potatoes involves spraying the crop with foliar fungicides.\nApply scheduled sprays, in order to avoid the disease from developing. Both protectant and systemic fungicides are available. Protectant fungicides create a protective coat on the stems and leaves to prevent infection, while systemic fungicides protect other plant parts from being infected.\nCrop must be sprayed before the infection occurs, because it is difficult to stop the spread of an existing disease.\nFungicides that are used against phytophthora infestans in potato include Ametoctradin, Benalaxyl, Benthiavalicarb- Isopropyl, Chlorothalonil, Copper hydroxide (for organic potato production), Dimethomorph, Mancozeb, Metalaxyl and some others.\n"
  },
  {
    "id": "36",
    "name": "Potato___virus",
    "description": "Some common potato viruses include Potato Virus Y (PVY), Potato Virus X (PVX), Potato Leafroll Virus (PLRV), and Potato Virus S (PVS)\ntreatment & prevention:\nUse Certified Virus-Free Seed Potatoes: Start with healthy seed potatoes that have been certified as virus-free.\nRogueing: Regularly inspect the potato crop, and promptly remove and destroy any plants showing symptoms of viral infection. This process is known as rogueing.\nVector Control: Some viruses are transmitted by insect vectors, such as aphids. Implement control measures for these vectors to reduce virus transmission.\nGood Agricultural Practices: Implement practices that promote overall plant health, such as proper irrigation, fertilization, and weed control.\nResistant Varieties: Plant potato varieties that are resistant or less susceptible to specific viruses.\nCrop Rotation: Rotate away from potatoes for at least one season to break the disease cycle.\nMonitoring: Regularly monitor the potato field for signs of viral infection, and take appropriate actions if symptoms are observed.\n"
  },
  {
    "id": "37",
    "name": "Raspberry___healthy",
    "description": "Don’t worry the plant is healthy.\n"
  },
  {
    "id": "38",
    "name": "Rice___bacterial_blight",
    "description": "Why and where it occurs\nThe disease is most likely to develop in areas that have weeds and stubbles of infected plants. It can occur in both tropical and temperate environments, particularly in irrigated and rainfed lowland areas. In general, the disease favors temperatures at 25 to 34°C, with relative humidity above 70%.\nIt is commonly observed when strong winds and continuous heavy rains occur, allowing the disease-causing bacteria to easily spread through ooze droplets on lesions of infected plants.\nBacterial blight can be severe in susceptible rice varieties under high nitrogen fertilization.\ntreatment:\nThere are methods to control rice blight: biological control and chemical control.\nBiological Control - Till today there is no biological product, available commercially to control bacterial rice blight. But there are some of the products based on copper that would help to reduce the symptoms but cannot control the disease.\nChemical Method -  To fight against bacterial blight, rice seeds are treated with authorized antibiotics with copper oxychloride or copper sulfate has been recommended.  In some of the countries the use of antibiotics is prohibited, So go through your country guidelines before using them.\nPreventive Measures of Bacterial Blight\n-Some of the preventive measures taken to prevent bacterial blight of paddy (rice) are:\n-It can be prevented by using healthy seeds, like from a certified source.\n-Bacterial blight-resistant rice varieties, it is one of the most effective and reliable ways to control diseases, and also it is one of the cheapest ways of prevention.\n-By properly handling the seedlings during transplanting.\n-By properly adjusting the nitrogen fertilizers and by applying the extra dose of potash along with the last dose of nitrogen, when weather conditions are favourable.\n-By avoiding the use of nitrogen in the form of urea.\n-By removing a weed and other hosts from the rice field and by ploughing under rice stubble, straw, ratoons,  and volunteer seedlings can serve as hosts for the bacteria.\n-Leave the land uncultivated in between the season to suppress the disease agents in the soil and plant residues.\n"
  },
  {
    "id": "39",
    "name": "Rice___blast",
    "description": "This disease is caused by a fungus named Pyricularia grisea, which overwinters in rice seeds and infected rice stubble. The fungus reproductive structures, spores, can spread from these two sources to rice plants during the next growing season and initiate new infections. Spores from these new infections can spread by wind to other rice plants over great distances.\nPreventive Measures for Blast Disease in Rice:\nStubble Management: Incorporate or roll rice stubble after harvest for early decomposition.\nVariety Selection: Plant least-susceptible rice varieties; use broad-spectrum seed treatment.\nField Location: Grow rice in open fields without tree lines, especially on east and south sides.\nFlood Management: Maintain flood levels easily; keep soil flooded 2 to 4 inches deep from 6 to 8 inches tall until draining for harvest.\nField History Consideration: Avoid fields with a history of straighthead; choose blast-resistant varieties for these fields.\nDiverse Planting Dates: Seed over a range of time to spread heading dates, but avoid late planting for reduced blast severity.\nPlant Density: Seed to a stand of 15 to 20 plants per square foot.\nNitrogen Management: Avoid excessive nitrogen; apply no more than 30 pounds per acre per midseason application. In blast-prone fields, split nitrogen applications.\ntreatment:\nUse fungicides:\nScout fields for blast symptoms from the seedling through heading stages (see Scouting). If symptoms are found, prepare to use fungicides at the late boot stage and again when 80 to 90 percent of plants are headed.\nApply fungicides during the time frame predicted by the DD50 program , which is about 5 to 7 days before heading (late boot stage). Fungicides are especially needed if blast symptoms have been observed in the field and the variety is very susceptible. Fungicides should be applied a second time about two days after 50 percent heading (90 percent head exsertion). In uniform stands, 90 percent heading will occur in 4 to 5 days after the first heads are visible.\nThe decision to treat is more easily made when one or more of the following factors exist:\n-A susceptible variety is grown in the field.\n-The crop has excessive growth and a dense canopy.\n-Leaf symptoms have been found in the field.\n-Disease is present in southern parts of the field.\n-Cool, rainy, or cloudy weather with high humidity and heavy dews is predicted during heading.\n"
  },
  {
    "id": "40",
    "name": "Rice___brown_spot",
    "description": "Why and where it occurs\nThe disease can develop in areas with high relative humidity (86 to 100%) and temperature between 16 and 36°C. It is common in unflooded and nutrient-deficient soil, or in soils that accumulate toxic substances.\nFor infection to occur, the leaves must be wet for 8 to 24 hours.\nThe fungus can survive in the seed for more than four years and can spread from plant to plant through air. Major sources of brown spot in the field include:\n-infected seed, which give rise to infected seedlings\n-volunteer rice\n-infected rice debris\n-weeds\nHow to manage:\nImproving soil fertility is the first step in managing brown spot. To do this:\n-monitor soil nutrients regularly\n-apply required fertilizers\n-for soils that are low in silicon, apply calcium silicate slag before planting\ntreatment:\nFertilizers can be costly and may take many cropping seasons before becoming effective. More economical management options include:\n-Use resistant varieties.\n-Use fungicides (e.g., iprodione, propiconazole, azoxystrobin, trifloxystrobin, and carbendazim) as seed treatments.\n-Treat seeds with hot water (53 or 54°C) for 10 to 12 minutes before planting, to control primary infection at the seedling stage. To increase effectiveness of treatment, pre-soak seeds in cold water for eight hours.\n"
  },
  {
    "id": "41",
    "name": "Rice___tungro",
    "description": "Why and where it occurs\nTungro disease viruses are transmitted from one plant to another by leafhoppers that feed on tungro-infected plants. The most efficient vector is the green leafhopper.\nIt can transmit the viruses to other plants within 5 to 7 days.\nTungro infection can occur during all growth stages of the rice plant. It is most frequently seen during the vegetative phase. Plants are most vulnerable at tillering stage.\nTungro incidence depends on the availability of the virus sources and vector population. Other than infected rice plants in the farmer's field, other primary sources for tungro, include:\n-stubble of previous crops\n-new growth from infected stubbles that had not been properly plowed under and harrowed effectively\n-volunteer rice\n-infected plants in nearby rice fields\n-Seedlings raised in nurseries or seedbeds can also be infected with Tungro prior to transplanting and can be a primary source of virus.\nTransplanting seedlings from nurseries in tungro-infected areas has also shown to increase infection rates in the field, particularly, in cases where seedbed is in a tungro-endemic area or when the nursery duration is 5 to 6 weeks.\nHow to manage:\n(Once a rice plant is infected by tungro, it cannot be cured).\nPreventive measures are more effective for the control of tungro than direct disease control measures. Using insecticides to control leafhoppers is often not effective, because green leafhoppers continuously move to surrounding fields and spread tungro rapidly in very short feeding times.\nThe most practical measures at present, include:\n-Grow tungro or leafhopper resistant varieties.\n-Practice synchronous planting with surrounding farms.\n-Delayed or late planting, relative to the average date in a given area, makes the field susceptible for Tungro. Late-planted fields also pose a risk to early planting in the next season.Adjust planting times to when green leafhopper are not in season or abundant, if known\n-Plow infected stubbles immediately after harvest to reduce inoculum sources and destroy the eggs and breeding sites of green leaf hopper.\n"
  },
  {
    "id": "42",
    "name": "Soybean___healthy",
    "description": "Don’t worry the plant is healthy.\n"
  },
  {
    "id": "43",
    "name": "Squash___powdery_mildew",
    "description": "powdery mildew infections are caused by several different species of fungus.\nIt's spread by wind, insects, and on tools and hands that touch infected plants\nPreventing Powdery Mildew on Squash Plants:\nPlant Resistant Varieties: Choose squash varieties marked as \"PMR\" for powdery mildew resistance.\nOptimal Seed Spacing: Follow recommended seed spacing for good air circulation, reducing the spread of powdery mildew.\nFull Sun Planting: Plant squash in full sun to minimize shady conditions that promote spore germination.\nAvoid Overfertilization: Do not overfertilize to prevent overstimulation of tender new growth, which is more susceptible to infection.\nWatering Practices:\nWater plants in the morning to allow leaves to dry before night, minimizing disease development.\nUse overhead watering or hose spraying to combat powdery mildew, as it thrives less in hot, dry conditions.\nCrop Rotation: Rotate squash crops to different locations on a three to four-year schedule to prevent overwintering spores in the soil.\ntreatment:\nFirst, remove infected leaves as soon as you detect the white powdery spots. If any plants show severe symptoms, remove them altogether. Put infected plant parts in the trash (not your compost pile) so the disease doesn't spread to healthy plants. And avoid handling healthy plants after touching diseased plants. This is a sure way to spread the disease. The same applies to tools used on diseased plants. Make sure first to wash your hands and disinfect your tools with a 10% bleach solution.\nSeveral organic sprays can help minimize the disease. They're most useful early in the infection; they won't cure powdery mildew once it's severe. One of the most effective sprays is neem oil, an extract from the tropical neem tree. It's a good control for mild to moderate powdery mildew infections. Spray both upper and lower surfaces of leaves. Apply every week until you detect no more symptoms, then every two weeks to avoid the mildew's return. Sulfur sprays and stylet oil fungicides will also reduce the spread of powdery mildew. Only spray when temperatures are below 90°F to prevent burn and don't spray when bees are active.\n"
  },
  {
    "id": "44",
    "name": "Strawberry___healthy",
    "description": "Don’t worry the plant is healthy.\n"
  },
  {
    "id": "45",
    "name": "Strawberry___leaf_scorch",
    "description": "Leaf spot is caused by the fungus, Mycosphaerella fragariae.\nThe fungus overwinters as spores in lesions on leaves. The fungus infects the plant and produces more spores in spots on the upper and lower leaf surface that spread the disease during early summer. These spores are spread by splashing rain. Middle-aged leaves are most susceptible. Lesions also develop on stems, petioles and runners.\nhow to manage & treatment:\nIn matted row or perennial strawberry systems, select a planting site with good air drainage and sun exposure. Cultivars resistant to leaf scorch may be available and need to be evaluated for specific horticultural characteristics. Plant new transplants frequently, and allow adequate spacing between them to increase airflow. Control weeds. Avoid amendment with supplemental nitrogen in spring, as this may enhance disease. Keep moisture levels down and avoid long wetness periods by monitoring irrigation schedules; if possible, use drip irrigation rather than overhead. Remove foliage and crop residues after picking or at renovation to remove inoculum and delay disease increase in late summer and fall. Fungicide treatments are effective during the flowering period, and during late summer and fall.\n"
  },
  {
    "id": "46",
    "name": "Sugercane___healthy",
    "description": "Don’t worry the plant is healthy.\n"
  },
  {
    "id": "47",
    "name": "Sugercane___mosaic",
    "description": "Mosaic is one of the most important sugarcane diseases, caused by single or compound infection of Sugarcane mosaic virus (SCMV), Sorghum mosaic virus (SrMV), and/or Sugarcane streak mosaic virus (SCSMV)\nprevention & treatment:\n-Sugarcane mosaic is managed by resistant varieties and  disease-free (approved) seed.\n-Regularly obtaining disease-free (approved) seed is important\nin the management of mosaic.\n- Disease-free seed plots must be regularly inspected for mosaic and, if infected plants are found, they must be immediately destroyed to prevent further spread.\n-Disease-free seed plots should be located away from known sources of mosaic infection.\n-Controlling weeds on which the aphid vectors can breed within fields and surrounding headlands may help to reduce spread.\n-Quarantine is important to prevent the spread of infected plants to districts where mosaic is not present and to prevent exotic strains of mosaic from entering Australia.\n"
  },
  {
    "id": "48",
    "name": "Sugercane___red_rot",
    "description": "Pathogen:\nRed rot disease is caused by the fungus Glomerella tucumanensis. An older name, Colletotrichum falcatum.\ntreatment & prevention:\nCultural method:\n-The best way to control red rot is to select setts for planting from healthy plants in a disease- free area.\n-The red rot affected field must be rotated with rice for one season and other crops for two seasons.\n-Growing of recommended resistant and moderately resistant varieties viz., Co 86032,  Co 86249, CoSi 95071, CoG 93076, CoC 22, CoSi 6 and CoG 5.\nPhysical method:\n-Removal of the affected clumps at an early stage and soil drenching with  Carbendazim 50 WP (1 gm in 1 litre of water)\n-The cut ends and entire setts should be dipped in a fungicide solution, such as one per cent Bordeaux mixture.\n-If the disease is noticed in the field, the leaves and canes should be collected and destroyed by burning.\nChemical method:\n-Adopt sett treatment with Carbendazim before planting (Carbendazim 50 WP (0.5 gm in 1 litre of water) or Carbendazim 25 DS (1gm in 1 litre of water) along with 2.5 kg of Urea in 250 litre of water\n-Use fungitoxic chemicals like Bavistan, Benomyl, Topsin and Aretan at 0.1 per cent for 18 min. at 52ºC for dipping setts which gave almost complete elimination of rot infection.\n"
  },
  {
    "id": "49",
    "name": "Sugercane___rust",
    "description": "There are two well-known rust diseases of sugarcane – orange rust and brown rust\nbrown rust:\nCauses of Sugarcane Brown Rust:\nThe causal agent of brown rust in sugarcane is the fungus Puccinia melanocephala. Brown rust is a common fungal disease that affects sugarcane plants. The disease is caused by the presence and activity of this specific rust fungus, which belongs to the order Pucciniales.\nBrown rust tends to thrive in warm and humid conditions, which are favorable for the development and spread of the fungus.\nThe fungus may overwinter on infected crop residues or other plant materials, contributing to the persistence of the disease across seasons.\ntreatment of brown rust of sugarcane:\nTwo sprays of propineb (0.2%) or mancozeb 75 WP (0.3%) at 15 days intervals from the initiation of the symptoms were found effective against the disease. The cost benefit ratio was the highest (1.02) by Mancozeb 75 WP (0.3%).\norange rust:\nthe disease is caused by the fungus of puccinia kuehnii.it is spread by rust that produces spores that are microsopic,light and hardy,which makes it easy for rapid short and long distance dospersal by wind and water splash,the spores also survive in plant residues in the soil. the disease is usually observed in summer and early autumn with warm,wet and highly humid environmental conditions.it infected more mature cane usually more than 6 months in age .\ntreatment of orange rust of sugarcane:\nalways consider an integrated approach with preventive measures .\nfungicides can reduce yield losses,spray plants with strobilurin class fungicides such as pyraclostrobin and azoxystrobin , which can be used to treat the disease .\nalso, triazole class fungicides such as metcondazole and propicondazole can be applied at 3 to 4 weeks intervals.\npreventive measures:\n-plant resistant varites\n-practice good santiation of the field or orchard by removing plant debris\n-regularly monitor field or orchard for signs of the disease\n"
  },
  {
    "id": "50",
    "name": "Sugercane___yellow_leaf",
    "description": "Pathogen:\nThe virus is transmitted by aphids, Melanaphis sacchari and Rhopalosiphum maidis, in a semi-persistent manner.\nSCYLV is a member of the Luteoviridae family. The virus is localized within the phloem cells of the plant.\ntreatment:-\n-Organic Control\nControl of aphid populations is essential to control the transmission of the virus. Check the lower side of the leaves for aphids and, if found, treat immediately with insecticidal soap, neem oil or pyrethroid-based organic products. Predators feeding on aphids can also be used.\n-Chemical Control\nAlways consider an integrated approach with preventive measures and biological treatments, if available. You can prevent secondary transmission by insect vectors by applying Malathion 0.1% or Dimecron  0.2%. Two applications of malathion 1.5 kg/ha should be sprayed twice at a monthly interval after detrashing of dry leaves.\nPreventive Measures :\n• Use only disease-free seed material and plant resistant varieties, if available.\n• By planting your seeds first in a nursery and later transplanting them to your field will contribute to\navoiding the disease.\n• Use yellow sticky traps for the control of aphid vector.\nStrip off mature leaves regularly, as aphids prefer to colonize those more often.\n"
  },
  {
    "id": "51",
    "name": "Tomato___bacterial_spot",
    "description": "Where does bacterial spot come from?\nBacterial spot of tomato is caused by Xanthomonas vesicatoria, Xanthomonas euvesicatoria, Xanthomonas gardneri, and Xanthomonas perforans.  These bacterial pathogens can be introduced into a garden on contaminated seed and transplants, which may or may not show symptoms.\nDisease development is favored by warm (75° to 86°F), wet weather.  Wind-driven rain can contribute to more severe disease as the pathogens are splashed and spread to healthy leaves and fruit.\nHow do I save plants with bacterial spot?\nA plant with bacterial spot cannot be cured.  Remove symptomatic plants from the field or greenhouse to prevent the spread of bacteria to healthy plants.  Burn, bury or hot compost the affected plants and DO NOT eat symptomatic fruit.\nHow can I prevent bacterial spot in the future?\nPlant pathogen-free seed or transplants to prevent the introduction of bacterial spot pathogens on contaminated seed or seedlings.  If a clean seed source is not available or you suspect that your seed is contaminated, soak seeds in water at 122°F for 25 min. to kill the pathogens.  To keep leaves dry and to prevent the spread of the pathogens, avoid overhead watering (e.g., with a wand or sprinkler) of established plants and instead use a drip-tape or soaker-hose.\nAlso to prevent spread, DO NOT handle plants when they are wet (e.g., from dew) and routinely sterilize tools with either 10% bleach solution or (better) 70% alcohol.  Where bacterial spot has been a recurring problem, consider using preventative applications of copper-based products registered for use on tomato, especially during warm, wet periods.  Keep in mind however, that if used excessively or for prolonged periods, copper may no longer control the disease.\nBe sure to read and follow all label instructions of the product that you select to ensure that you use it in the safest and most effective manner possible.  Burn, bury or hot compost tomato debris at the end of the season.  Wait at least one year before planting tomatoes in a given location again, and remove and burn, bury or hot compost any volunteer tomatoes that come up in your garden.\n"
  },
  {
    "id": "52",
    "name": "Tomato___early_blight",
    "description": "Common on tomato and potato plants, early blight is caused by the fungus Alternaria solani .\nEarly blight overwinters on infected plant tissue and is spread by splashing rain, irrigation, insects and garden tools. The disease is also carried on tomato seeds and in potato tubers. In spite of its name, early blight can occur any time throughout the growing season. High temperatures (80 to 85˚F.) and wet, humid conditions promote its rapid spread. In many cases, poorly nourished or stressed plants are attacked.\nTreatment & Prevention:\n1.Pruning and Staking:\nImprove air circulation by pruning or staking plants to reduce fungal issues.\n2.Disinfecting Pruning Tools:\nDisinfect pruning shears (1 part bleach to 4 parts water) after each cut.\n3.Clean Soil and Organic Compost:\nKeep soil clean; add organic compost to prevent spore splashing onto vegetation.\n4.Drip Irrigation and Soaker Hoses:\nUse drip irrigation or soaker hoses to keep foliage dry.\n5.Early Application of Copper-Based Fungicides:\nApply copper-based fungicides two weeks before disease typically appears or during extended wet weather.\n6.Bonide Garden Dust:\nUse Garden Dust, containing copper and pyrethrins, covering both leaf surfaces. Repeat every 7 to 10 days  like Bonide  Garden Dust,.\n7.Debris Removal and Crop Rotation:\nRemove and destroy garden debris after harvest; practice crop rotation the following year.\n8.Dispose of Infected Plant Parts:\nBurn or bag infected plant parts; do NOT compost.\n"
  },
  {
    "id": "53",
    "name": "Tomato ___healthy",
    "description": "Don’t worry the plant is healthy.\n"
  },
  {
    "id": "54",
    "name": "Tomato___late_blight",
    "description": "Found on tomato and potato plants, late blight is caused by the fungus Phytophthora infestans . True to its name, the disease occurs later in the growing season with symptoms often not appearing until after blossom.\nUnlike other fungal diseases, this plant problem does not overwinter in the soil or on garden trash. Instead the spores are introduced by infected tubers, transplants or seeds. Wind will also carry the disease from nearby gardens. Warm temperatures (70 to 80˚F) and wet, humid conditions promote its rapid spread.\nTreatment & prevention:\n1.Plant resistant cultivars when available.\n2.Remove volunteers from the garden prior to planting and space plants far enough apart to allow for plenty of air circulation.\n3.Water in the early morning hours, or use soaker hoses, to give plants time to dry out during the day — avoid overhead irrigation.\n4.Destroy all tomato debris after harvest .\nIf symptoms are observed, treat plants with one of the following fungicides:\n-Apply a copper based fungicide (2 oz/ gallon of water) every 7 days or less, following heavy rain or when the amount of disease is increasing rapidly. If possible, time applications so that at least 12 hours of dry weather follows application.\n-Used as a foliar spray, Organocide Plant Doctor will work its way through the entire plant to prevent fungal problems from occurring and attack existing many problems. Mix 2 tsp/ gallon of water and spray at transplant or when direct seeded crops are at 2 to 4 true leaf, then at 1 to2 week intervals as required to control disease.\n-Safely treat fungal problems with SERENADE Garden. This broad spectrum bio-fungicide uses a patented strain of Bacillus subtilis and is approved for organic use. Best of all, SERENADE is completely non-toxic to honey bees and beneficial insects.\n-Monterey All Natural Disease Control is a ready-to-use blend of naturally occurring ingredients that control most plant foliar diseases. All stages of the disease is controlled, but applying before infestation gives the best results.\n"
  },
  {
    "id": "55",
    "name": "Tomato___leaf_curl",
    "description": "Causes and Remedies for Tomato Leaf Curl:\n1.Tough Growing Conditions:\nCause: Hot weather, lack of moisture, and heat stress.\nRemedy: Ensure adequate watering (1 inch per week), supplement with irrigation, avoid overhead watering, and use mulch to retain soil moisture.\n2.Too Much Pruning:\nCause: Excessive removal of foliage during pruning.\nRemedy: Water the plant well, let new leaves remain, and allow the plant time to recover.\n3.Transplant Shock:\nCause: Stress from transplanting, temperature fluctuations, and root disturbance.\nRemedy: Provide ample water during the settling period, acclimate seedlings before planting, and transplant on cooler days or provide temporary shade.\n4.Weed Killers:\nCause: Herbicide contamination in compost or mulch.\nRemedy: No direct cure; adopt a \"wait and see\" approach. Some plants may recover, while others may not fruit.\n5.Tomato Diseases (Viruses):\nCause: Viral infections leading to twisting and twining new growth.\nRemedy: No cure for viruses. Remove the infected plant to prevent spread. Choose virus-resistant varieties in the future.\n"
  },
  {
    "id": "56",
    "name": "Tomato___leaf_mold",
    "description": "Tomato leaf mold is caused by a fungal pathogen called Passalora fulva (syn. Cladosporium fulvum). It is an ascomycete fungus that -Cause: Fungal pathogen Passalora fulva (syn. Cladosporium fulvum).\n-Transmission: Spread by wind or water splash; triggered by relative humidity > 85% for conidia germination.\n-Infection Process: Conidia germination leads to hyphal growth on the leaf surface; after additional growth, the fungus enters the plant.\n-Spread Mechanisms: Potential spread through infected seed, tools, and workers inadvertently carrying the pathogen to new tomato plants.\ntreatment & prevention:\nResistant cultivars: Current resistant cultivars include ‘Dombello’, ‘Estrella’, Eurocross BB’, ‘Grenadier’, ‘Shirley’ and ‘Cumulus’\nNon-chemical control:\nProvide ample ventilation to avoid an excessively moist atmosphere\nTry to avoid wetting the leaves when watering. This is particularly important when watering in the evening, as the leaves may then stay wet throughout the night\nAvoid an over-dry soil or growing medium (which could also lead to other problems such as blossom end rot)\nTry to avoid temperatures above 21°C (70°F)\nTrim off some of the lower leaves once fruit has set to encourage air circulation\nRemove diseased plants promptly to prevent pathogen spread.\nDispose of infected plant material and sterilize equipment.\nRotate crops and move high tunnels regularly to reduce nutrient and disease buildup.\nEnsure clean seeds from reputable sources.\nChemical Treatments:\nFor organic trials: Champ 30 WG and Zonix showed effective control.\nConventional growers can use products like Quadris Top (azoxystrobin and difenoconazole) or Bravo Weather Stik (chlorothalonil) for control\n"
  },
  {
    "id": "57",
    "name": "Tomato___mosaic_virus",
    "description": "How do plants get the mosaic virus?\nMosaic virus is a viral disease that can be spread by weeds, infected seeds, an infected plant, or certain insects.\nMosaic virus overwinters on perennial weeds and is spread by insects that feed on them. Aphids, leafhoppers, whiteflies, and cucumber beetles are common garden pests that can transmit this disease.\ntreatment:\nThere are no cures for viral diseases, such as the mosaic virus.\nprevention:\n1.Fungicides will NOT treat this viral disease.\n2.Plant resistant varieties when available or purchase transplants from a reputable source.\n3.Do NOT save seeds from infected crops.\n4.Spot treat with least-toxic, natural pest control products, such as Safer Soap, Bon-Neem, and diatomaceous earth, to reduce the number of disease-carrying insects.\n5.Harvest-Guard® row cover will help keep insect pests off vulnerable crops/ transplants and should be installed until bloom.\n6.Remove all perennial weeds, using least-toxic herbicides, within 100 yards of your garden plot.\n7.The virus can be spread through human activity, tools, and equipment. Frequently wash your hands and disinfect garden tools, stakes, ties, pots, greenhouse benches, etc. (one part bleach to 4 parts water) to reduce the risk of contamination.\n8.Avoid working in the garden during damp conditions (viruses are easily spread when plants are wet).\n9.Avoid using tobacco around susceptible plants. Cigarettes and other tobacco products may be infected and can spread the virus.\n10.Remove and destroy all infected plants (see Fall Garden Cleanup). Do NOT compost.\n"
  },
  {
    "id": "58",
    "name": "Tomato___septoria_leaf_spot",
    "description": "Septoria leaf spot is caused by a fungus, Septoria lycopersici. It is one of the most destructive diseases of tomato foliage and is particularly severe in areas where wet, humid weather persists for extended periods.\ntreatment & prevention:\n1.Remove Diseased Leaves:\n-Early removal of lower infected leaves; burn or destroy them.\n-Collect and dispose of all foliage from infected plants at the end of the season.\n-Do not compost diseased plants.\n2.Improve Air Circulation:\n-Stake or cage plants to raise them off the ground.\n-Promote faster drying of foliage to reduce disease spread.\n3.Mulch Around Plants:\n-Apply mulch after soil has warmed to reduce soil splashing containing fungal spores.\n4.Avoid Overhead Watering:\n-Use a soaker hose at the base of the plant to keep foliage dry.\n-Water early in the day to prevent disease spread.\n5.Weed Control:\n-Eradicate nightshade and horsenettle, common hosts of Septoria leaf spot.\n6.Crop Rotation:\n-Avoid planting tomatoes in the same location where diseased tomatoes grew for 1 to 2 years.\n7.Fungicidal Sprays:\n-Apply fungicides at 7 to 10 days intervals throughout the season.\n-Options include chlorothalonil, maneb, mancozeb, or copper-based fungicides like Bordeaux mixture, copper hydroxide, copper sulfate, or copper oxychloride sulfate.\n-Adhere to harvest restrictions listed on the pesticide label.\n"
  },
  {
    "id": "59",
    "name": "Tomato___spider_mites",
    "description": "Spider mites are most common in hot, dry conditions, especially where their natural enemies have been killed off by insecticide use.\n(treatment)Controlling Spider Mites Naturally:\n1.Prune Infested Parts:\n-Prune leaves, stems, and affected plant parts well past webbing.\n-Discard in the trash, not compost.\n-Consider pulling entire plants to prevent spread.\n2.Proper Watering:\n-Ensure proper watering to reduce water stress and plant susceptibility.\n3.Water Spray:\n-Use a strong stream of water with the Bug Blaster to wash plants and --reduce mite numbers.\n-Mid-season hosing removes dust, preventing mite encouragement.\n4.Beneficial Insects:\n-Release commercially available beneficial insects (ladybugs, lacewings, predatory mites) when pest levels are low to medium.\n5.Horticultural Oils:\n-Apply insecticidal soaps or botanical insecticides for spot treatment.\n-Use horticultural oil early in the season or late in fall on fruit trees to destroy overwintering eggs.\n6.Neem Oil Application:\n-Mix pure neem oil with Coco-Wet and apply every 3 to 5 days.\n-Spray all plant parts, including undersides of leaves.\n-Avoid application in temperatures exceeding 90˚F.\n7.Insecticides:\n-Consider using organic insecticides like Nuke Em or BotaniGard ES.\n-Apply least-toxic, short-lived pesticides (Take Down Spray, Doktor Doom Foggers) for high populations, then release predatory mites for ongoing control.\nNote: Chemical pesticide use is discouraged as it can harm beneficial insects and lead to mite resistance. Utilizing natural and organic methods is more effective for sustainable control.\nprevention:\n1.One of the best ways to protect your plants is to check them regularly. A 10x hand lens will make this much easier. Every 3 to 5 days, check your plants and see if there are any leaves with white or yellow spots on them.\n2.If you find any, check the underside of the leaf with the 10x hand lens. If you see webbing or mites, you will need to treat the plant.\n3.If you don’t have a magnifying glass, you can also place a white sheet of paper under the plant leaves and tap the leaf sharply. The spider mites will tumble off the leaf and onto the paper.\n4.If you discover spider mites while examining plants, it is best to isolate the plant away from other plants so the spider mites do not spread. If this is not possible, then immediate treatment of the mites is necessary to avoid a major infestation in your garden plants.\n"
  },
  {
    "id": "60",
    "name": "Tomato___target_spot",
    "description": "Target spot of tomato is caused by the fungal pathogen Corynespora cassiicola.\ntreatment and prevention:\nCULTURAL CONTROL\nCultural control is important. The following should be done:\nBefore planting:\n-Do not plant new crops next to older ones that have the disease.\n-Plant as far as possible from papaya, especially if leaves have small angular spots (Photo 5).\n-Check all seedlings in the nursery, and throw away any with leaf spots.\nDuring growth:\n-Remove a few branches from the lower part of the plants to allow better airflow at the base\n-Remove and burn the lower leaves as soon as the disease is seen, especially after the lower fruit trusses have been picked.\n-Keep plots free from weeds, as some may be hosts of the fungus.\n-Do not use overhead irrigation; otherwise, it will create conditions for spore production and infection.\nAfter harvest:\n-Collect and burn as much of the crop as possible when the harvest is complete.\n-Practise crop rotation, leaving 3 years before replanting tomato on the same land.\nCHEMICAL CONTROL:\nWarm wet conditions favour the disease such that fungicides are needed to give adequate control. The products to use are chlorothalonil, copper oxychloride or mancozeb. Treatment should start when the first spots are seen and continue at 10 to 14 days intervals until 3 to 4 weeks before last harvest. It is important to spray both sides of the leaves.\n"
  }
]